IdeaRS.OpenModel.Detail.BentUpBar
Representing bent-Up bar in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.BentUpBar.#ctor
Constructor

IdeaRS.OpenModel.Detail.BentUpBar.MasterComponent
Master component of reinforcement

IdeaRS.OpenModel.Detail.BentUpBar.IsOnLeft
Bar is on left or right side of member1D

IdeaRS.OpenModel.Detail.BentUpBar.Offset
Offset of bent-Up bar from left/right edge

IdeaRS.OpenModel.Detail.BentUpBar.Angle
Angle between bar and master edge

IdeaRS.OpenModel.Detail.BentUpBar.TopLength
Length of additional bar on the top

IdeaRS.OpenModel.Detail.BentUpBar.BottomLength
Length of additional bar on the bottom

IdeaRS.OpenModel.Detail.BentUpBar.AddAnchor
Add anchor to bent up bar

IdeaRS.OpenModel.Detail.BentUpBar.AnchorLength
Length of anchor for bent up bar